MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l12/thirdparty/mspm0l12/ti/devices/msp/peripherals/hw_trng.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_trng__include
#define ti_devices_msp_peripherals_hw_trng__include

/* Filename: hw_trng.h */
/* Revised: 2023-06-13 16:12:38 */
/* Revision: f9b237fa1b82e8166ce3ead25b505b784578352a */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* TRNG Registers
******************************************************************************/
#define TRNG_CPU_INT_OFS                         ((uint32_t)0x00001020U)
#define TRNG_GPRCM_OFS                           ((uint32_t)0x00000800U)


/** @addtogroup TRNG_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} TRNG_CPU_INT_Regs;

/*@}*/ /* end of group TRNG_CPU_INT */

/** @addtogroup TRNG_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} TRNG_GPRCM_Regs;

/*@}*/ /* end of group TRNG_GPRCM */

/** @addtogroup TRNG
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  TRNG_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[514];
  TRNG_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED2[44];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module descriptions */
  __IO uint32_t CTL;                               /* !< (@ 0x00001100) Controls the command and decimation rate */
  __I  uint32_t STAT;                              /* !< (@ 0x00001104) Status register that informs health test results
                                                      and last issued command */
  __I  uint32_t DATA_CAPTURE;                      /* !< (@ 0x00001108) Captured word buffer of RNG data */
  __I  uint32_t TEST_RESULTS;                      /* !< (@ 0x0000110C) Test results from TEST_ANA and TEST_DIG */
  __IO uint32_t CLKDIVIDE;                         /* !< (@ 0x00001110) Clock Divider */
} TRNG_Regs;

/*@}*/ /* end of group TRNG */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* TRNG Register Control Bits
******************************************************************************/

/* TRNG_IIDX Bits */
/* TRNG_IIDX[STAT] Bits */
#define TRNG_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define TRNG_IIDX_STAT_MASK                      ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define TRNG_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define TRNG_IIDX_STAT_IRQ_HEALTH_FAIL           ((uint32_t)0x00000001U)         /* !< Indicates that a health test has
                                                                                    failed. The TRNG is in an error state
                                                                                    until the interrupt is cleared. */
#define TRNG_IIDX_STAT_IRQ_CMD_FAIL              ((uint32_t)0x00000002U)         /* !< Indicates that the just issued
                                                                                    command was rejected and is not being
                                                                                    performed. */
#define TRNG_IIDX_STAT_IRQ_CMD_DONE              ((uint32_t)0x00000003U)         /* !< Indicates that the current
                                                                                    command/mode is done. This may have
                                                                                    different meanings based on the mode:
                                                                                    OFF --> Power has been turned off
                                                                                    PWRUP_DIG --> Digital powerup tests
                                                                                    are done PWRUP_ANA --> Analog powerup
                                                                                    tests are done NORM_FUNC --> No IRQ,
                                                                                    since mode runs indefinitely until a
                                                                                    new command is issued */
#define TRNG_IIDX_STAT_IRQ_CAPTURED_RDY          ((uint32_t)0x00000004U)         /* !< Indicates that the captured word
                                                                                    buffer is ready to be copied to
                                                                                    memory */

/* TRNG_IMASK Bits */
/* TRNG_IMASK[IRQ_HEALTH_FAIL] Bits */
#define TRNG_IMASK_IRQ_HEALTH_FAIL_OFS           (0)                             /* !< IRQ_HEALTH_FAIL Offset */
#define TRNG_IMASK_IRQ_HEALTH_FAIL_MASK          ((uint32_t)0x00000001U)         /* !< Mask for IRQ_HEALTH_FAIL. Indicates
                                                                                    that a health test has failed. */
#define TRNG_IMASK_IRQ_HEALTH_FAIL_DISABLED      ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define TRNG_IMASK_IRQ_HEALTH_FAIL_ENABLED       ((uint32_t)0x00000001U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* TRNG_IMASK[IRQ_CAPTURED_RDY] Bits */
#define TRNG_IMASK_IRQ_CAPTURED_RDY_OFS          (3)                             /* !< IRQ_CAPTURED_RDY Offset */
#define TRNG_IMASK_IRQ_CAPTURED_RDY_MASK         ((uint32_t)0x00000008U)         /* !< Mask for IRQ_CAPTURED_RDY.
                                                                                    Indicates to the CPU that the
                                                                                    Captured Word is ready to be read. */
#define TRNG_IMASK_IRQ_CAPTURED_RDY_DISABLED     ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define TRNG_IMASK_IRQ_CAPTURED_RDY_ENABLED      ((uint32_t)0x00000008U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* TRNG_IMASK[IRQ_CMD_DONE] Bits */
#define TRNG_IMASK_IRQ_CMD_DONE_OFS              (2)                             /* !< IRQ_CMD_DONE Offset */
#define TRNG_IMASK_IRQ_CMD_DONE_MASK             ((uint32_t)0x00000004U)         /* !< Mask for IRQ_CMD_DONE. Indicates
                                                                                    that a command has finished */
#define TRNG_IMASK_IRQ_CMD_DONE_DISABLED         ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define TRNG_IMASK_IRQ_CMD_DONE_ENABLED          ((uint32_t)0x00000004U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* TRNG_IMASK[IRQ_CMD_FAIL] Bits */
#define TRNG_IMASK_IRQ_CMD_FAIL_OFS              (1)                             /* !< IRQ_CMD_FAIL Offset */
#define TRNG_IMASK_IRQ_CMD_FAIL_MASK             ((uint32_t)0x00000002U)         /* !< Masked interrupt source for
                                                                                    IRQ_CMD_FAIL. Indicates that the just
                                                                                    issued command/mode has been
                                                                                    rejected. */
#define TRNG_IMASK_IRQ_CMD_FAIL_DISABLED         ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define TRNG_IMASK_IRQ_CMD_FAIL_ENABLED          ((uint32_t)0x00000002U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */

/* TRNG_RIS Bits */
/* TRNG_RIS[IRQ_CAPTURED_RDY] Bits */
#define TRNG_RIS_IRQ_CAPTURED_RDY_OFS            (3)                             /* !< IRQ_CAPTURED_RDY Offset */
#define TRNG_RIS_IRQ_CAPTURED_RDY_MASK           ((uint32_t)0x00000008U)         /* !< Indicates to the CPU that the
                                                                                    Captured Word is ready to be read.
                                                                                    Reading the IIDX will clear this
                                                                                    interrupt. */
#define TRNG_RIS_IRQ_CAPTURED_RDY_CLR            ((uint32_t)0x00000000U)         /* !< IRQ_CAPTURED_READY did not occur */
#define TRNG_RIS_IRQ_CAPTURED_RDY_SET            ((uint32_t)0x00000008U)         /* !< IRQ_CAPTURED_READY occurred */
/* TRNG_RIS[IRQ_HEALTH_FAIL] Bits */
#define TRNG_RIS_IRQ_HEALTH_FAIL_OFS             (0)                             /* !< IRQ_HEALTH_FAIL Offset */
#define TRNG_RIS_IRQ_HEALTH_FAIL_MASK            ((uint32_t)0x00000001U)         /* !< Indicates to the CPU that any of
                                                                                    the health tests have failed. Reading
                                                                                    the IIDX  will clear this interrupt. */
#define TRNG_RIS_IRQ_HEALTH_FAIL_CLR             ((uint32_t)0x00000000U)         /* !< IRQ_CAPTURED_READY did not occur */
#define TRNG_RIS_IRQ_HEALTH_FAIL_SET             ((uint32_t)0x00000001U)         /* !< IRQ_CAPTURED_READY occurred */
/* TRNG_RIS[IRQ_CMD_DONE] Bits */
#define TRNG_RIS_IRQ_CMD_DONE_OFS                (2)                             /* !< IRQ_CMD_DONE Offset */
#define TRNG_RIS_IRQ_CMD_DONE_MASK               ((uint32_t)0x00000004U)         /* !< Raw interrupt source for
                                                                                    IRQ_CMD_DONE. Indicates that the
                                                                                    issued command/mode has completed. */
#define TRNG_RIS_IRQ_CMD_DONE_CLR                ((uint32_t)0x00000000U)         /* !< IRQ_CMD_DONE did not occur */
#define TRNG_RIS_IRQ_CMD_DONE_SET                ((uint32_t)0x00000004U)         /* !< IRQ_CMD_DONE occurred */
/* TRNG_RIS[IRQ_CMD_FAIL] Bits */
#define TRNG_RIS_IRQ_CMD_FAIL_OFS                (1)                             /* !< IRQ_CMD_FAIL Offset */
#define TRNG_RIS_IRQ_CMD_FAIL_MASK               ((uint32_t)0x00000002U)         /* !< Masked interrupt source for
                                                                                    IRQ_CMD_FAIL. Indicates that the just
                                                                                    issued command/mode has been
                                                                                    rejected. */
#define TRNG_RIS_IRQ_CMD_FAIL_CLR                ((uint32_t)0x00000000U)         /* !< IRQ_CMD_FAIL did not occur */
#define TRNG_RIS_IRQ_CMD_FAIL_SET                ((uint32_t)0x00000002U)         /* !< IRQ_CMD_FAIL occurred */

/* TRNG_MIS Bits */
/* TRNG_MIS[IRQ_CAPTURED_RDY] Bits */
#define TRNG_MIS_IRQ_CAPTURED_RDY_OFS            (3)                             /* !< IRQ_CAPTURED_RDY Offset */
#define TRNG_MIS_IRQ_CAPTURED_RDY_MASK           ((uint32_t)0x00000008U)         /* !< Masked interrupt result for
                                                                                    CAPTURED_READY. Indicates to the CPU
                                                                                    that the Captured Word is ready to be
                                                                                    read. Reading the IIDX  will clear
                                                                                    this interrupt. */
#define TRNG_MIS_IRQ_CAPTURED_RDY_CLR            ((uint32_t)0x00000000U)         /* !< IRQ_CAPTURED_READY did not request
                                                                                    an interrupt service routine */
#define TRNG_MIS_IRQ_CAPTURED_RDY_SET            ((uint32_t)0x00000008U)         /* !< IRQ_CAPTURED_READY requests an
                                                                                    interrupt service routine */
/* TRNG_MIS[IRQ_HEALTH_FAIL] Bits */
#define TRNG_MIS_IRQ_HEALTH_FAIL_OFS             (0)                             /* !< IRQ_HEALTH_FAIL Offset */
#define TRNG_MIS_IRQ_HEALTH_FAIL_MASK            ((uint32_t)0x00000001U)         /* !< Masked interrupt result for
                                                                                    HEALTH_FAIL. Indicates to the CPU
                                                                                    that any of the health tests have
                                                                                    failed for the latest 1024-bit
                                                                                    window. */
#define TRNG_MIS_IRQ_HEALTH_FAIL_CLR             ((uint32_t)0x00000000U)         /* !< IRQ_CAPTURED_READY did not request
                                                                                    an interrupt service routine */
#define TRNG_MIS_IRQ_HEALTH_FAIL_SET             ((uint32_t)0x00000001U)         /* !< IRQ_CAPTURED_READY requests an
                                                                                    interrupt service routine */
/* TRNG_MIS[IRQ_CMD_DONE] Bits */
#define TRNG_MIS_IRQ_CMD_DONE_OFS                (2)                             /* !< IRQ_CMD_DONE Offset */
#define TRNG_MIS_IRQ_CMD_DONE_MASK               ((uint32_t)0x00000004U)         /* !< Masked interrupt source for
                                                                                    IRQ_CMD_DONE. Indicates that the
                                                                                    issued command/mode has completed. */
#define TRNG_MIS_IRQ_CMD_DONE_CLR                ((uint32_t)0x00000000U)         /* !< IRQ_CAPTURED_READY did not request
                                                                                    an interrupt service routine */
#define TRNG_MIS_IRQ_CMD_DONE_SET                ((uint32_t)0x00000004U)         /* !< IRQ_CMD_DONE requests an interrupt
                                                                                    service routine */
/* TRNG_MIS[IRQ_CMD_FAIL] Bits */
#define TRNG_MIS_IRQ_CMD_FAIL_OFS                (1)                             /* !< IRQ_CMD_FAIL Offset */
#define TRNG_MIS_IRQ_CMD_FAIL_MASK               ((uint32_t)0x00000002U)         /* !< Masked interrupt source for
                                                                                    IRQ_CMD_FAIL. Indicates that the just
                                                                                    issued command/mode has been
                                                                                    rejected. */
#define TRNG_MIS_IRQ_CMD_FAIL_CLR                ((uint32_t)0x00000000U)         /* !< IRQ_CMD_FAIL did not request an
                                                                                    interrupt service routine */
#define TRNG_MIS_IRQ_CMD_FAIL_SET                ((uint32_t)0x00000002U)         /* !< IRQ_CMD_FAIL requests an interrupt
                                                                                    service routine */

/* TRNG_ISET Bits */
/* TRNG_ISET[IRQ_CAPTURED_RDY] Bits */
#define TRNG_ISET_IRQ_CAPTURED_RDY_OFS           (3)                             /* !< IRQ_CAPTURED_RDY Offset */
#define TRNG_ISET_IRQ_CAPTURED_RDY_MASK          ((uint32_t)0x00000008U)         /* !< Indicates to the CPU that the
                                                                                    Captured Word is ready to be read.
                                                                                    Reading the IIDX or DATA_CAPTURE
                                                                                    registers will clear this interrupt. */
#define TRNG_ISET_IRQ_CAPTURED_RDY_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define TRNG_ISET_IRQ_CAPTURED_RDY_SET           ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to
                                                                                    CAPTURED_READY is set */
/* TRNG_ISET[IRQ_HEALTH_FAIL] Bits */
#define TRNG_ISET_IRQ_HEALTH_FAIL_OFS            (0)                             /* !< IRQ_HEALTH_FAIL Offset */
#define TRNG_ISET_IRQ_HEALTH_FAIL_MASK           ((uint32_t)0x00000001U)         /* !< Indicates to the CPU that any of
                                                                                    the health tests have failed. Reading
                                                                                    the IIDX or DATA_CAPTURE registers
                                                                                    will clear this interrupt. */
#define TRNG_ISET_IRQ_HEALTH_FAIL_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define TRNG_ISET_IRQ_HEALTH_FAIL_SET            ((uint32_t)0x00000001U)         /* !< RIS bit corresponding to
                                                                                    HEALTH_FAIL is set */
/* TRNG_ISET[IRQ_CMD_DONE] Bits */
#define TRNG_ISET_IRQ_CMD_DONE_OFS               (2)                             /* !< IRQ_CMD_DONE Offset */
#define TRNG_ISET_IRQ_CMD_DONE_MASK              ((uint32_t)0x00000004U)         /* !< Write to turn on CMD_DONE IRQ.
                                                                                    Indicates that the last issued TRNG
                                                                                    command has finished. */
#define TRNG_ISET_IRQ_CMD_DONE_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect. */
#define TRNG_ISET_IRQ_CMD_DONE_SET               ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to CMD_DONE
                                                                                    is set */
/* TRNG_ISET[IRQ_CMD_FAIL] Bits */
#define TRNG_ISET_IRQ_CMD_FAIL_OFS               (1)                             /* !< IRQ_CMD_FAIL Offset */
#define TRNG_ISET_IRQ_CMD_FAIL_MASK              ((uint32_t)0x00000002U)         /* !< Masked interrupt source for
                                                                                    IRQ_CMD_FAIL. Indicates that the just
                                                                                    issued command/mode has been
                                                                                    rejected. */
#define TRNG_ISET_IRQ_CMD_FAIL_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect. */
#define TRNG_ISET_IRQ_CMD_FAIL_SET               ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to CMD_FAIL
                                                                                    is set */

